namespace AlgorithmsDataStructures2
{
    // ========================================================================

    // Рефлексия по уроку 3.

    // Задание 4.
    // Метод, определяющий уровень с максимальной суммой значений узлов.
    // Использовался обход в ширину по уровню, по пути и т.д
    // и возвращающий IEnumerable. Но можно было бы сделать и версию, в
    // которую встраиваются например Action, для обработки результатов
    // обхода на разных этапах.

    // Задание 5.
    // Восстановление оригинального дерева из результатов префиксного и инфиксного обхода.
    // Мой алгоритм хоть и работает и прошел тесты, но видно что он мог быть проще
    // и эффективнее за счёт того, что для восстановления BST достаточно одного префиксного
    // обхода.
}
