/*
Вот и подошёл к завершению второй курс АСД. 

Курс показался мне в целом сложнее чем первый (хотя некоторые задания первого для меня 
всё ещё лидеры по сложности). Остались только положительные ощущения, очень приятное 
чувство, когда разобрался в чём-то новом для себя, что раньше откладывал из-за пугающей сложности).

Удивило и понравилась работа с деревом как массивом, а также работа с графом и поиск 
пути. Появилось желание изучить графы подробнее, особенно работу со взвешенным ориентированным. 

Проходя курс я вспоминал рабочие задачи, которые с новыми знаниями я бы решал иначе 
и не сомневаюсь что быстрее и эффективнее. Также выросло понимание в связанных прикладных 
темах (например B-tree индексы БД).
Самое главное что я чувствую для себя, что лес разрозненных знаний формируется 
в единое древо понимания. 

Спасибо Вам большое, Сергей Игоревич, за ещё один отличный курс)
*/